Lovejourney_Working/lovejourney_working/HotelAPILayer/Service References/ArzooHotelAvailSearch/HotelAvailSearch.wsdl

<?xml version="1.0" encoding="utf-8"?>
<wsdl:definitions xmlns:soapenc12="http://www.w3.org/2003/05/soap-encoding" xmlns:soapenc11="http://schemas.xmlsoap.org/soap/encoding/" xmlns:soap12="http://www.w3.org/2003/05/soap-envelope" xmlns:tns="http://search.hotel.com" xmlns:wsdlsoap="http://schemas.xmlsoap.org/wsdl/soap/" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap11="http://schemas.xmlsoap.org/soap/envelope/" targetNamespace="http://search.hotel.com" xmlns:wsdl="http://schemas.xmlsoap.org/wsdl/">
  <wsdl:types />
  <wsdl:message name="getHotelAvailSearchResponse">
    <wsdl:part name="out" type="xsd:string" />
  </wsdl:message>
  <wsdl:message name="getHotelAvailSearchRequest">
    <wsdl:part name="in0" type="xsd:string" />
    <wsdl:part name="in1" type="xsd:string" />
  </wsdl:message>
  <wsdl:portType name="HotelAvailSearchPortType">
    <wsdl:operation name="getHotelAvailSearch">
      <wsdl:input name="getHotelAvailSearchRequest" message="tns:getHotelAvailSearchRequest" />
      <wsdl:output name="getHotelAvailSearchResponse" message="tns:getHotelAvailSearchResponse" />
    </wsdl:operation>
  </wsdl:portType>
  <wsdl:binding name="HotelAvailSearchHttpBinding" type="tns:HotelAvailSearchPortType">
    <wsdlsoap:binding transport="http://schemas.xmlsoap.org/soap/http" style="rpc" />
    <wsdl:operation name="getHotelAvailSearch">
      <wsdlsoap:operation soapAction="" />
      <wsdl:input name="getHotelAvailSearchRequest">
        <wsdlsoap:body use="literal" namespace="http://search.hotel.com" />
      </wsdl:input>
      <wsdl:output name="getHotelAvailSearchResponse">
        <wsdlsoap:body use="literal" namespace="http://search.hotel.com" />
      </wsdl:output>
    </wsdl:operation>
  </wsdl:binding>
  <wsdl:service name="HotelAvailSearch">
    <wsdl:port name="HotelAvailSearchHttpPort" binding="tns:HotelAvailSearchHttpBinding">
      <wsdlsoap:address location="http://59.162.33.102/HotelXML_V1.2/services/HotelAvailSearch" />
    </wsdl:port>
  </wsdl:service>
</wsdl:definitions>